Tekla Open API Reference for Tekla Structures 2025
IndirectPolymeshEdge Properties
The IndirectPolymeshEdge type exposes the following members.
Properties
Name | Description
EdgeType
 Type of the edge.
EndPoint
 End point of the edge.
ShellIndex
 The index of the shell the edge belongs to.
StartPoint
 Start point of the edge.
Top
See Also
Reference
IndirectPolymeshEdge Class
Tekla.Structures.Geometry3d Namespace